It is possible to construct vector spaces several ways in Sage.  For now, we will show you two basic ways.  Remember that while our theory is all developed over the complex numbers, $\complexes$, it is better to initially illustrate these ideas in Sage using the rationals, \verb?QQ?.\par
%
To create a vector space, we use the \verb?VectorSpace()? constructor, which requires the name of the number system for the entries and the number of entries in each vector.  We can display some information about the vector space, and with tab-completion you can see what functions are available.  We will not do too much with these methods immediately, but instead learn about them as we progress through the theory.
%
\begin{sageexample}
sage: V = VectorSpace(QQ, 8)
sage: V
Vector space of dimension 8 over Rational Field
\end{sageexample}
%
Notice that the word ``dimension'' is used to refer to the number of entries in a vector contained in the vector space, whereas we have used the word ``degree'' before.  Try pressing the Tab key while in the next cell to see the range of methods you can use on a vector space.
%
\begin{sageverbatim}
sage: V.
\end{sageverbatim}
%
We can easily create ``random'' elements of any vector space, much as we did earlier for the kernel of a matrix.  Try executing the next compute cell several times.
%
\begin{sageverbatim}
sage: w = V.random_element()
sage: w         # random
(2, -1/9, 0, 2, 2/3, 0, -1/3, 1)
\end{sageverbatim}
%
Vector spaces are a fundamental objects in Sage and in mathematics, and Sage has a nice compact way to create them, mimicking the notation we use when working on paper.
%
\begin{sageexample}
sage: U = CC^5
sage: U
Vector space of dimension 5 over
Complex Field with 53 bits of precision
sage: W = QQ^3
sage: W
Vector space of dimension 3 over Rational Field
\end{sageexample}
%
Sage can determine if two vector spaces are the same.  Notice that we use two equals sign to test equality, since we use a single equals sign to make assignments.
%
\begin{sageexample}
sage: X = VectorSpace(QQ, 3)
sage: W = QQ^3
sage: X == W
True
\end{sageexample}
%
\begin{sageverbatim}
\end{sageverbatim}
%

